SecurityEvent
| where EventID == 10
| extend EventDataDynamic = parse_json(EventData)
| extend 
    TargetImage = tostring(EventDataDynamic.TargetImage),
    SourceImage = tostring(EventDataDynamic.SourceImage),
    GrantedAccess = tostring(EventDataDynamic.GrantedAccess),
    Account = coalesce(TargetUserName, SubjectUserName)
| where TargetImage endswith "lsass.exe"
| where GrantedAccess in ("0x1410","0x1010","0x143a","0x1fffff")
| project TimeGenerated, Computer, Account, SourceImage, TargetImage, GrantedAccess
