SecurityEvent
| where EventID in (8, 10)
| extend EventDataDynamic = parse_json(EventData)
| extend 
    TargetImage = tostring(EventDataDynamic.TargetImage),
    SourceImage = tostring(EventDataDynamic.SourceImage),
    GrantedAccess = tostring(EventDataDynamic.GrantedAccess),
    Account = coalesce(TargetUserName, SubjectUserName)
| where TargetImage endswith "lsass.exe" 
      or TargetImage endswith "explorer.exe" 
      or TargetImage endswith "services.exe"
| project TimeGenerated, Computer, Account, SourceImage, TargetImage, EventID, GrantedAccess
