SecurityEvent
| where EventID in (4673,4674)
| extend PrivilegesParsed = extract(@"Privileges:\s*(.+?)(?:\r|\n|$)", 1, EventData)
| where PrivilegesParsed has_any ("SeDebugPrivilege","SeTcbPrivilege","SeImpersonatePrivilege")
| project TimeGenerated, Computer, SubjectUserName, PrivilegesParsed, ProcessName
